In [247]:
import pandas as pd

In [248]:
file1 = "raw_data/employee_data1.csv"
file2 = "raw_data/employee_data2.csv"

df1 = pd.read_csv(file1,low_memory=False)
df2 = pd.read_csv(file2,low_memory=False)

In [249]:
df = df1.append(df2)

In [250]:
df.head()

   Emp ID           Name         DOB          SSN         State
0     214  Sarah Simpson  1985-12-04  282-01-8166       Florida
1      15  Samantha Lara  1993-09-08  848-80-7526      Colorado
2     411  Stacy Charles  1957-12-20  658-75-8526  Pennsylvania
3     166   Michelle Roy  1978-07-29  794-25-3944      Michigan
4      39  Joseph Rogers  1985-03-28  525-40-3515     Minnesota

In [251]:
df.columns

Index(['Emp ID', 'Name', 'DOB', 'SSN', 'State'], dtype='object')

In [252]:
df[['Name','Last Name']] = df['Name'].str.split(' ',expand=True)
df.rename(columns={'Name': 'First Name'}, inplace=True)
df['SSN'] = "***-**-" + df.SSN.str[7:]
df['DOB'] = pd.to_datetime(df['DOB']).dt.strftime('%m/%d/%Y')

In [253]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [254]:
df["State"].replace(us_state_abbrev, inplace=True)
df.head()

   Emp ID First Name         DOB          SSN State Last Name
0     214      Sarah  12/04/1985  ***-**-8166    FL   Simpson
1      15   Samantha  09/08/1993  ***-**-7526    CO      Lara
2     411      Stacy  12/20/1957  ***-**-8526    PA   Charles
3     166   Michelle  07/29/1978  ***-**-3944    MI       Roy
4      39     Joseph  03/28/1985  ***-**-3515    MN    Rogers

In [255]:
df = df[['Emp ID', 'First Name', 'Last Name', 'DOB', 'SSN', 'State']]
df.head()

   Emp ID First Name Last Name         DOB          SSN State
0     214      Sarah   Simpson  12/04/1985  ***-**-8166    FL
1      15   Samantha      Lara  09/08/1993  ***-**-7526    CO
2     411      Stacy   Charles  12/20/1957  ***-**-8526    PA
3     166   Michelle       Roy  07/29/1978  ***-**-3944    MI
4      39     Joseph    Rogers  03/28/1985  ***-**-3515    MN

In [256]:
len(df)

2770

In [257]:
df.to_csv("employee_data_all.csv", index=False, header=True)